Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: Subjects have to be static or global variables, or dynamically-allocated :cpp:type:`lv_subject_t` objects.
it_it: I Subject devono essere variabili statiche o globali, oppure oggetti :cpp:type:`lv_subject_t` allocati dinamicamente.

source: Subscribe to a group Subject (connects a group of Subjects) to get notified when any of the Subjects' values change in the group.
it_it: Ci si iscrive a un gruppo Subject (connette un gruppo di Subject) per ricevere una notifica quando uno qualsiasi dei valori dei Subject nel gruppo cambia.

source: Subscribing While Associating Observer with a Non-Widget Object
it_it: Sottoscrizione Durante l'Associazione dell'Observer a un Oggetto Non-Widget

source: Subscribing While Associating Observer with a Widget
it_it: Sottoscrizione Durante l'Associazione dell'Observer a un Widget

source: Subscribing to a Subject
it_it: Iscrizione a un Subject

source: Subsequent revisions of the recipe conventionally have the values "r1", "r2", and so forth.
it_it: Le revisioni successive della ricetta hanno convenzionalmente i valori "r1", "r2" e così via.

source: Subsequently launching the LVGL Editor, after the `ui` project has been created, will trigger it to re-scan the Renesas `configuration.xml`.
it_it: Al successivo avvio di LVGL Editor, dopo la creazione del progetto `ui` verrà avviata una nuova scansione del file `configuration.xml` di Renesas.

source: Such concept also has some similarities to `UiViewController on iOS <https://developer.apple.com/documentation/uikit/uiviewcontroller>`__.
it_it: Questo concetto presenta anche alcune somiglianze con `UiViewController su iOS <https://developer.apple.com/documentation/uikit/uiviewcontroller>`__.

source: Such pointers need to be defined in a special way to make them reachable by the GC.
it_it: Tali puntatori devono essere definiti in modo specifico per renderli raggiungibili dal GC.

source: Such strings are passed as the image source like this:
it_it: Tali stringhe vengono passate come sorgente dell'immagine in questo modo:

source: Supply LVGL with a callback function to retrieve elapsed system milliseconds by calling :cpp:expr:`lv_tick_set_cb(my_get_milliseconds)`.
it_it: Fornire a LVGL una funzione di callback per recuperare i millisecondi di sistema trascorsi chiamando :cpp:expr:`lv_tick_set_cb(my_get_milliseconds)`.

source: Support
it_it: Supporto

source: Support LVGL pointer, keypad, and encoder device integration
it_it: Supporta l'integrazione di puntatori, tastiere e dispositivi encoder LVGL

source: Support Windows input method integration
it_it: Supporta l'integrazione del metodo di input di Windows

source: Support Windows touch input
it_it: Supporta l'input touch di Windows

source: Support all LVGL built-in components
it_it: Supporta tutti i componenti LVGL nativi

source: Support dynamic image loading
it_it: Supporta il caricamento dinamico delle immagini

source: Support end
it_it: Fine del supporto

source: Support for cameras defined within 3D editor software
it_it: Supporto per telecamere definite all'interno del software di editing 3D

source: Support for color formats depends on the drawing unit.
it_it: Il supporto per i formati colore dipende dall'unità di disegno.

source: Support for hex-encoded bytes in source include files when filesystem is not available
it_it: Supporto per byte codificati in esadecimale nei file "include" quando il file system non è disponibile

source: Support for thousands of processes and millions of threads
it_it: Supporto per migliaia di processi e milioni di thread

source: Support most LVGL styles, just write like HTML5 CSS
it_it: Supporta la maggior parte degli stili LVGL, basta scrivere come CSS HTML5

source: Support per-monitor DPI awareness (both V1 and V2)
it_it: Supporta il riconoscimento DPI per monitor (sia V1 che V2)

source: Supported Asset Formats
it_it: Formati di Risorse Supportati

source: Supported Boards
it_it: Board Supportate

source: Supported Doxygen Commands
it_it: Comandi Doxygen Supportati

source: Supported boards in the RA Family:
it_it: Schede supportate nella RA Family:

source: Supported boards in the RX Family:
it_it: Schede supportate nella RX Family:

source: Supported boards in the RZ/A Family:
it_it: Schede supportate nella RZ/A Family:

source: Supported boards in the RZ/G Family:
it_it: Schede supportate nella RZ/G Family:

source: Supported by offline converter
it_it: Supportato dal convertitore offline

source: Supported devices
it_it: Dispositivi supportati

source: Supported draw tasks are available in "src/draw/nx/g2d/lv_draw_g2d.c":
it_it: Le attività di disegno supportate sono disponibili in "src/draw/nx/g2d/lv_draw_g2d.c":

source: Supported draw tasks are available in "src/draw/nxp/pxp/lv_draw_pxp.c":
it_it: Le attività di disegno supportate sono disponibili in "src/draw/nxp/pxp/lv_draw_pxp.c":

source: Supported draw tasks are available in "src/draw/nxp/vglite/lv_draw_vglite.c":
it_it: Le attività di disegno supportate sono disponibili in "src/draw/nxp/vglite/lv_draw_vglite.c":

source: Supported image formats: determined by enabled LVGL :ref:`image decoders <image_decoders>`.
it_it: Formati immagine supportati: determinati dai :ref:`decoder di immagini <image_decoders>` LVGL abilitati .

source: Supported properties of ``<animation>`` are:
it_it: Le proprietà supportate di ``<animation>`` sono:

source: Supporting multiple simultaneous touch points: just create multiple input devices.
it_it: Supporto di più punti di touch simultanei: è sufficiente creare più dispositivi di input.

source: Supports GLCDC interrupts to handle frame-buffer switching or underflow detection
it_it: Supporta gli interrupt GLCDC per gestire la commutazione del frame buffer o il rilevamento dell'underflow.

source: Supports LCD panels with RGB interface (up to 24 bits) and sync signals (HSYNC, VSYNC and Data Enable optional)
it_it: Supporta pannelli LCD con interfaccia RGB (fino a 24 bit) e segnali di sincronizzazione (HSYNC, VSYNC e Data Enable opzionali)

source: Supports ``min-width``, ``max-width``, ``min-height``, and ``max-height``.
it_it: Supporta ``min-width``, ``max-width``, ``min-height`` e ``max-height``.

source: Supports a wide range of `architectures and chips <https://www.rt-thread.io/board.html>`__
it_it: Supporta un'ampia gamma di `architetture e chip <https://www.rt-thread.io/board.html>`__

source: Supports all mainstream compiling tools such as GCC, Keil and IAR.
it_it: Supporta tutti i principali strumenti di compilazione come GCC, Keil e IAR.

source: Supports brightness adjustment, contrast adjustment, and gamma correction
it_it: Supporta la regolazione della luminosità, del contrasto e la correzione gamma.

source: Supports high-performance applications.
it_it: Supporta applicazioni ad alte prestazioni.

source: Supports many architectures (x86, x86-64, ARM, ARM Thumb, Xtensa).
it_it: Supporta molte architetture (x86, x86-64, ARM, ARM Thumb, Xtensa).

source: Supports only positive values.
it_it: Supporta solo valori positivi.

source: Supports pixel, percentage, and ``content`` units.
it_it: Supporta le unità di misura pixel, percentuale e ``content``.

source: Supports the Color Look-Up Table (CLUT) usage for input graphics planes (ARGB8888) with 512 words (32 bits/word)
it_it: Supporta l'utilizzo della Color Look-Up Table (CLUT) per i piani grafici in ingresso (ARGB8888) con 512 word (32 bit/word)

source: Supports various color formats for input graphics planes (RGB888, ARGB8888, RGB565, ARGB1555, ARGB4444, CLUT8, CLUT4, CLUT1)
it_it: Supporta vari formati colore per i piani grafici in ingresso (RGB888, ARGB8888, RGB565, ARGB1555, ARGB4444, CLUT8, CLUT4, CLUT1)

source: Supports various color formats for output (RGB888, RGB666, RGB565, Serial RGB888)
it_it: Supporta vari formati colore per l'output (RGB888, RGB666, RGB565, Serial RGB888)

source: Swapping Endian-ness
it_it: Scambio di Byte Endian

source: Switch Orientation
it_it: Orientamento dello Switch

source: Switch Widgets look like little sliders and are used to display, and optionally modify, a value that can be "on" or "off".
it_it: I Widget Switch hanno l'aspetto di piccoli cursori e vengono utilizzati per visualizzare, e facoltativamente modificare, un valore che può essere "on" o "off".

source: Symbol
it_it: Simbolo

source: Symbols
it_it: Simboli

source: Symbols are only implemented for :ref:`lv_image` Widgets.
it_it: I simboli sono implementati solo per i Widget :ref:`lv_image`.

source: Symbols that can be used as an image source are ``char *`` strings beginning with a Unicode character encoded in UTF-8, which will have a first-byte value >= 0x80.
it_it: I simboli che possono essere utilizzati come sorgente di immagini sono stringhe ``char *`` che iniziano con un carattere Unicode codificato in UTF-8, il cui valore del primo byte sarà >= 0x80.

source: Symbols_
it_it: Simboli_

source: Sync project with Figma.
it_it: Sincronizza il progetto con Figma.

source: Synchronization Primitive provided by OS
it_it: Primitiva di Sincronizzazione fornita dal sistema operativo

source: Synchronize the styles and images from Figma:
it_it: Sincronizzare stili e immagini da Figma:

source: Synchronizing Style Properties
it_it: Sincronizzazione delle Proprietà di Stile

source: Syntax
it_it: Sintassi

source: System Layer (above Top Layer, transparent and neither scroll-able nor click-able)
it_it: Layer di Sistema (sopra il Layer Superiore, trasparente e non scorrevole né cliccabile)

source: System Monitor (sysmon)
it_it: Monitor di Sistema (sysmon)

source: System host name to ``lvgl-buildroot`` under ``system_configuration > System hostname``.
it_it: Nome host di sistema in ``lvgl-buildroot`` in ``system_configuration > System hostname``.

source: TFT | OLED Display
it_it: Display TFT | OLED

source: TFTs with 16 or 24 bit color depth
it_it: TFT con profondità di colore a 16 o 24 bit

source: TL;DR: Similar to MicroPython, it's very much like the C API, but Object-Oriented for LVGL components.
it_it: In breve: Simile a MicroPython, è molto simile all'API C, ma orientata agli oggetti per i componenti LVGL.

source: TODO
it_it: TODO [da fare]

source: TODO: Add all things related to ``lv_conf.h`` file and its contents.
it_it: TODO: Aggiungere tutto ciò che riguarda il file ``lv_conf.h`` e il suo contenuto.

source: TODO: Description of Test Tab
it_it: TODO: Descrizione della Scheda Test

source: TSC (ThinkSilicon Compression) images can be drawn by this renderer.
it_it: Questo motore di rendering può disegnare immagini TSC (ThinkSilicon Compression).

source: TSC Images
it_it: Immagini TSC

source: Tab buttons: an :ref:`base_widget` with :ref:`lv_button`
it_it: Pulsanti Tab: un :ref:`base_widget` con :ref:`lv_button`

source: Table
it_it: Tabella

source: Table (lv_table)
it_it: Tabella (lv_table)

source: Table is an editable Widget, allowing selection of a cell with encoder and keyboard navigation as well.
it_it: La Table è un Widget modificabile, che consente la selezione di una cella con encoder e navigazione da tastiera.

source: Tables are built from rows, columns, and cells containing text.
it_it: Le "Table" [tabelle] sono costituite da righe, colonne e celle contenenti testo.

source: Tabs Coming Soon: Tests, Translations, Animations
it_it: Schede in Arrivo: Test, Traduzioni, Animazioni

source: Tabs on the left, styling and no scrolling
it_it: Tab a sinistra, con stile e nessuno scorrimento

source: Tag names follow the usual variable-name rules: they must start with a letter or ``'_'`` and the rest of the name may be comprised of letters, ``'_'`` and digits.
it_it: I nomi dei tag seguono le consuete regole per i nomi delle variabili: devono iniziare con una lettera o con ``'_'`` e il resto del nome può essere composto da lettere, ``'_'`` e cifre.

source: Tags like `vX.Y.Z` are created for every release.
it_it: Tag come `vX.Y.Z` vengono creati per ogni release.

source: Take a look at `LVGL_Arduino.ino <https://github.com/lvgl/lvgl/blob/master/examples/arduino/LVGL_Arduino/LVGL_Arduino.ino>`__ to see how to initialize LVGL.
it_it: Consultare `LVGL_Arduino.ino <https://github.com/lvgl/lvgl/blob/master/examples/arduino/LVGL_Arduino/LVGL_Arduino.ino>`__ per vedere come inizializzare LVGL.

source: Taking `NuttX <https://github.com/apache/nuttx>`_ RTOS as an example:
it_it: Prendendo come esempio `NuttX <https://github.com/apache/nuttx>`_ di RTOS:

source: Tasks that read from or write to this directory should run under fakeroot.
it_it: I task che leggono o scrivono in questa directory devono essere eseguiti con fakeroot.

source: Tasmota + Berry + LVGL could be used for:
it_it: Tasmota + Berry + LVGL possono essere utilizzati per:

source: Tasmota and berry
it_it: Tasmota e Berry

source: Tasmota firmware is downloaded more than 200,000 times each month, and has an active and growing community.
it_it: Il firmware Tasmota viene scaricato più di 200.000 volte al mese e vanta una community attiva e in crescita.

source: Tasmota provides access to hundreds of supported devices, full support of MQTT, HTTP(S), integration with major Home Automation systems, myriad of sensors, IR, RF, Zigbee, Bluetooth, AWS IoT, Azure IoT, Alexa and many more.
it_it: Tasmota offre accesso a centinaia di dispositivi supportati, supporto completo di MQTT, HTTP(S), integrazione con i principali sistemi di domotica, una miriade di sensori, IR, RF, Zigbee, Bluetooth, AWS IoT, Azure IoT, Alexa e molto altro.

source: Technology: TFT
it_it: Tecnologia: TFT

source: Tells whether to prefer speed or quality.
it_it: Indica se preferire la velocità o la qualità.

source: Temperature meter
it_it: Indicatore di temperatura

source: Terms
it_it: Termini

source: Test Tab
it_it: Scheda Test

source: Test XML files are similar to components but are wrapped in a ``<test>`` tag and consist of two main parts:
it_it: I file XML di test sono simili ai componenti, ma sono racchiusi nel tag ``<test>`` e sono composti da due parti principali:

source: Test between recolor style or full background modal
it_it: Test tra stile di ricolorazione o sfondo modale pieno

source: Test sources for audio and video development
it_it: Sorgenti di test per lo sviluppo audio e video

source: Tested at 32 MHz on ft812 and at 23 MHz on bt817.
it_it: Testato a 32 MHz su FT812 e a 23 MHz su BT817.

source: Testing hooks
it_it: Hook di test

source: Tests can be registered in two ways:
it_it: I test possono essere registrati in due modi:

source: Text Format
it_it: Formato del Testo

source: Text Management
it_it: Gestione del Testo

source: Text align
it_it: Allineamento del testo

source: Text alignment
it_it: Allineamento del testo

source: Text alignment.
it_it: Allineamento del testo.

source: Text area cursor styling
it_it: Stile del cursore dell'area di testo

source: Text area with password field
it_it: Area di testo con campo password

source: Text auto-formatting
it_it: Formattazione automatica del testo

source: Text can be set using :cpp:expr:`lv_arclabel_set_text(arclabel, "Your text")`.
it_it: Il testo può essere impostato utilizzando :cpp:expr:`lv_arclabel_set_text(arclabel, "Your text")`.

source: Text color.
it_it: Colore del testo.

source: Text decoration, e.g., underline.
it_it: Decorazione del testo, ad esempio, sottolineatura.

source: Text get functions (e.g. :cpp:func:`lv_label_get_text`) will return the processed text.
it_it: Le funzioni di acquisizione del testo (ad esempio :cpp:func:`lv_label_get_text`) restituiranno il testo elaborato.

source: Text opacity.
it_it: Opacità del testo.

source: Text or characters can be added to it.
it_it: È possibile aggiungervi testo o caratteri.

source: Text recolor
it_it: Ricolorazione del testo

source: Text selection
it_it: Selezione del testo

source: Text shadow
it_it: Ombreggiatura del testo

source: Text styles
it_it: Stili per il Testo

source: Textarea
it_it: Area di testo

source: Thanks
it_it: Ringraziamenti

source: That MCU overhead can be avoided by doing the above.
it_it: Questo sovraccarico della MCU può essere evitato eseguendo quanto sopra.

source: That Screen is referred to as the Display's "Active Screen".
it_it: Quello Screen è definito lo "Screen Attivo" del Display.

source: That Timer causes that input device to be read and also sends all input-device-related events, like :cpp:enumerator:`LV_EVENT_CLICKED`, :cpp:enumerator:`LV_EVENT_PRESSED`, etc.
it_it: Quel Timer determina la lettura del dispositivo di input e invia anche tutti gli eventi relativi al dispositivo di input, come :cpp:enumerator:`LV_EVENT_CLICKED`, :cpp:enumerator:`LV_EVENT_PRESSED`, ecc.

source: That Timer refreshes the display based on the configured value of :c:macro:`LV_DEF_REFR_PERIOD`, and also sends all display-related events, like :cpp:enumerator:`LV_EVENT_REFR_START`, :cpp:enumerator:`LV_EVENT_REFR_READY`, etc.
it_it: Il Timer aggiorna la visualizzazione in base al valore configurato di :c:macro:`LV_DEF_REFR_PERIOD` e invia anche tutti gli eventi relativi alla visualizzazione, come :cpp:enumerator:`LV_EVENT_REFR_START`, :cpp:enumerator:`LV_EVENT_REFR_READY`, ecc.

source: That ``struct`` must contain ``void * user_data`` field.
it_it: Tale ``struct`` deve contenere il campo ``void * user_data``.

source: That array is attached to the Widget's class, enabling "getter" and "setter" functions to be looked up for each type of Widget where Widget properties has been implemented.
it_it: Questo array è allegato alla classe del Widget, consentendo la ricerca delle funzioni "getter" e "setter" per ogni tipo di Widget in cui sono state implementate le proprietà Widget.

source: That can be useful to temporarily "disable" a Section, e.g. :cpp:expr:`lv_scale_section_set_range(section, 0, -1)`.)
it_it: Questo può essere utile per "disattivare" temporaneamente una Sezione, ad esempio :cpp:expr:`lv_scale_section_set_range(section, 0, -1)`.)

source: That data series will continue to use *your* array from that time onward.
it_it: Quella serie di dati continuerà a utilizzare *l'array fornito* da quel momento in poi.

source: That includes mice, keyboards, touchpads, touchscreens and graphics tablets.
it_it: Tra questi rientrano mouse, tastiere, touchpad, touchscreen e tavolette grafiche.

source: That is :cpp:expr:`lv_obj_get_width/height/x/y()` will return the original, non-zoomed coordinates.
it_it: Ciò significa che :cpp:expr:`lv_obj_get_width/height/x/y()` restituirà le coordinate originali, non ingrandite.

source: That is to receive a pointer to the ``struct`` as the first argument, and the prefix of the ``struct`` name should be used as the prefix of the function name as well (e.g. :cpp:expr:`lv_display_set_default(lv_display_t * disp)`)
it_it: Questo significa ricevere un puntatore alla ``struct`` come primo argomento, e il prefisso del nome della ``struct`` dovrebbe essere usato anche come prefisso del nome della funzione (ad esempio :cpp:expr:`lv_display_set_default(lv_display_t * disp)`)

source: That is, Screens **cannot** have:
it_it: Ciò significa che gli Screen **non possono** avere:

source: That is, a grid can have a sub-grid child, but that sub-grid cannot have another sub-grid.
it_it: Ovvero, una grid può avere una sub-grid figlia, ma tale sub-grid non può avere un'altra sub-grid.

source: That is, if ``images/logo.png`` was used in the UI Editor, then the full path will be ``"A:my_ui/v2.3/assets/images/logo.png"``.
it_it: Ciò significa che se ``images/logo.png`` è stato utilizzato nell'editor dell'interfaccia utente, il path completo sarà ``"A:my_ui/v2.3/assets/images/logo.png"``.

source: That is, the top side of the content can't be below the top side of the Widget, and vice versa for the bottom side.
it_it: Ovvero, il lato superiore del contenuto non può trovarsi al di sotto del lato superiore del Widget e viceversa per il lato inferiore.

source: That means it is the programmer's responsibility to see that no LVGL function is called while another LVGL call is in progress in another thread.
it_it: Ciò significa che è responsabilità del programmatore assicurarsi che nessuna funzione LVGL venga chiamata mentre è in corso un'altra chiamata LVGL in un altro thread.

source: That means that lv_micropython provides LVGL API for **any** LVGL version, and generally does not require code changes as LVGL evolves.
it_it: Ciò significa che lv_micropython fornisce l'API LVGL per **qualsiasi** versione di LVGL e generalmente non richiede modifiche al codice man mano che LVGL si evolve.

source: That's it.
it_it: Tutto qui.

source: That, combined with the output of ``pwd``, is the path you need to use later.
it_it: Questo, combinato con l'output di ``pwd``, è il percorso che si dovrà utilizzare in seguito.

source: That’s why placing your exported project under ``src/`` ensures everything is detected and compiled.
it_it: Ecco perché posizionare il progetto esportato in ``src/`` garantisce che tutto venga rilevato e compilato.

source: The "One-checked" feature can be enabled with :cpp:expr:`lv_buttonmatrix_set_one_checked(btn_matrix, true)` to allow only one button to be checked at a time.
it_it: La funzione "One-checked" [selezione unica] può essere abilitata con :cpp:expr:`lv_buttonmatrix_set_one_checked(btn_matrix, true)` per consentire la selezione di un solo pulsante alla volta.

source: The "`Classes <https://docs.yoctoproject.org/ref-manual/classes.
it_it: Il capitolo "`Classi <https://docs.yoctoproject.org/ref-manual/classes.

source: The "scroll one" feature tells LVGL to allow scrolling only one snappable child at a time.
it_it: La funzione "scroll one" [scorrimento singolo] indica a LVGL di consentire lo scorrimento di un solo elemento figlio agganciabile alla volta.

source: The "static" variant requires that the passed name remains valid while the Widget exists, since only the pointer is stored.
it_it: La variante "statica" richiede che il nome passato rimanga valido finché il Widget esiste, poiché viene memorizzato solo il puntatore.

source: The **DRM** (Direct Rendering Manager) display driver provides support for rendering LVGL directly to Linux framebuffer devices through the DRM/KMS subsystem.
it_it: Il driver del display **DRM** (Direct Rendering Manager) supporta il rendering LVGL direttamente sui dispositivi framebuffer Linux tramite il sottosistema DRM/KMS.

source: The **EGL** driver provides support for creating LVGL displays using the EGL (Embedded-System Graphics Library) API.
it_it: Il driver **EGL** fornisce supporto per la creazione di display LVGL utilizzando l'API EGL (Embedded-System Graphics Library).

source: The **EVE Intelligent Displays** feature a Bridgetek EVE graphics controller IC so that the display can be controlled using high-level drawing commands over a lower-bandwidth interface than RGB, MIPI, etc.
it_it: Gli **EVE Intelligent Display** sono dotati di un controller grafico IC Bridgetek EVE, in modo che il display possa essere controllato utilizzando comandi di disegno di alto livello su un'interfaccia a larghezza di banda inferiore rispetto a RGB, MIPI, ecc.

source: The **Evaluation Boards** are affordable carrier boards for getting Riverdi display panels up and running before designing or buying a carrier board for a production application.
it_it: Le **Evaluation Boards** sono schede di supporto convenienti per far funzionare i pannelli di visualizzazione Riverdi prima di progettare o acquistare una scheda di supporto per un'applicazione di produzione.

source: The **GLFW** display/input driver offers support for creating LVGL displays and keyboard/mouse inputs that can be used in an OpenGL context.
it_it: Il driver di display/input **GLFW** offre supporto per la creazione di display LVGL e input per tastiera/mouse utilizzabili in un contesto OpenGL.
